src/Documents/ПриказОПереводе/ПриказОПереводе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОПереводе</name>
  <registerRecords>InformationRegister.Учащиеся</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ТекущийФакультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяГруппа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйФакультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяГруппа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Студенты</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯвляетсяСтаростой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбучениеНаБюджетнойОснове</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОбучения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриказОПереводе/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПолучитьСтудентов(Команда)
	ПолучитьСтудентовНаСервере(Объект.ТекущаяГруппа, Объект.ТекущийФакультет, Объект.ТекущийКурс, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗапретИзмененияДокументовВызовСервера.ЗапретитьИзменениеЗакрытогоДокумента(Объект, ТолькоПросмотр);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтудентовНаСервере(УчебнаяГруппа, Факультет, Курс, Регистратор)
	Студенты = ПолучениеСтудентовВызовСервера.ПолучитьСтудентовИзРегистра(УчебнаяГруппа, Факультет, Курс, Регистратор,
		ЭтотОбъект);

	Если ЗначениеЗаполнено(Студенты) Тогда
		Объект.Студенты.Загрузить(Студенты);
	КонецЕсли;
КонецПроцедуры
